product = [{'name': 'сыр', 'категория': 'молочное', 'калорийность': 300, 'жиры': 150, 'белки': 100, 'углеводы': 30},
           {'name': 'каша овсяная', 'категория': 'молочное', 'калорийность': 250, 'жиры': 45, 'белки': 75, 'углеводы': 70},
           {'name': 'молоко', 'категория': 'молочное', 'калорийность': 85, 'жиры': 35, 'белки': 77, 'углеводы': 20},
           {'name': 'шоколад', 'категория': 'сладкое', 'калорийность': 500, 'жиры': 200, 'белки': 85, 'углеводы': 450},
           {'name': 'конфеты', 'категория': 'сладкое', 'калорийность': 350, 'жиры': 200, 'белки': 65, 'углеводы': 300},
           {'name': 'сок', 'категория': 'сладкое', 'калорийность': 185, 'жиры': 15, 'белки': 20, 'углеводы': 400},
           {'name': 'капуста тушёная', 'категория': 'овощи', 'калорийность': 100, 'жиры': 5, 'белки': 10, 'углеводы': 25},
           {'name': 'морковный салат', 'категория': 'овощи', 'калорийность': 75, 'жиры': 3, 'белки': 7, 'углеводы': 45},
           {'name': 'картофель на пару', 'категория': 'овощи', 'калорийность': 150, 'жиры': 10, 'белки': 30, 'углеводы': 40},
           {'name': 'дыня', 'категория': 'фрукты', 'калорийность': 70, 'жиры': 10, 'белки': 15, 'углеводы': 100},
           {'name': 'груша',  'категория': 'фрукты', 'калорийность': 110, 'жиры': 15, 'белки': 20, 'углеводы': 150},
           {'name': 'яблоко', 'категория': 'фрукты', 'калорийность': 100, 'жиры': 5, 'белки': 25, 'углеводы': 95},
           {'name': 'говядина', 'категория': 'мясо',  'калорийность': 450, 'жиры': 170, 'белки': 430, 'углеводы': 89},
           {'name': 'свинина', 'категория': 'мясо', 'калорийность': 600, 'жиры': 250, 'белки': 500, 'углеводы': 95},
           {'name': 'баранина', 'категория': 'мясо', 'калорийность': 350, 'жиры': 130, 'белки': 430, 'углеводы': 35}]

p = 0
foods = []
food = []
gramms = 0
calories = 0
fats = 0
proteins = 0
carbohydrates = 0
while p == 0:
    prod = input("Введите желаемый продукт:")
    for i in product:
        if prod in i['name']:
            food.append(prod)
            foods.append(i)print("""Для выхода нажмите 1
Чтобы продолжить нажмите 0""")
            p = int(input())
            if p > 0:
                break
            else:
                continue
            print("Введите количество граммов(не меньше 100):")
            gramms = int(input())
            calories += i['калорийность']*gramms/100
            fats += i['жиры']*gramms/100
            proteins += i['белки']*gramms/100
            carbohydrates += i['углеводы']*gramms/100

def keysnum(x):
    return x['калорийность']

print('Ваш список', sorted(foods, key=keysnum, reverse = True))
print("Вывод:")
print("Сумарная калорийность:", calories)
print("Жиры:", fats)
print("Белки:", proteins)
print("Углеводы:", carbohydrates)
